/********************************************************
                   http://www.sl.com.cn
         Ë«Áúµç×Ó¹«Ë¾----Ë«ÒôÆµĞÅºÅ(DTMF)ÑİÊ¾³ÌĞò
		 ¼üÅÌ²¼ÖÃÍ¼£º
		             1 2 3 A--PB4
		             4 5 6 B--PB5
					 7 8 9 C--PB6
					 * 0 # D--PB7
					 | | | |
					 P P P P
					 B B B B
					 0 1 2 3
		 À®°È½ÓÏßÍ¼£ºPD5(OC1A)--1Kµç×è--À®°È			 
********************************************************/ 
#include <io8515.h>
#include <macros.h>
#define  Xtal       8000000          // ÏµÍ³Ê±ÖÓÆµÂÊ
#define  prescaler  1                // T1Ô¤·ÖÆµÏµÊı
#define  N_samples  128              // ÔÚ²éÕÒ±íÖĞµÄÑù±¾Êı
#define  Fck        Xtal/prescaler   // T1¹¤×÷ÆµÂÊ
#define  delaycyc   10               // ¶ÁÈ¡port C¿ÚÑÓÊ±Ñ­»·Êı
#pragma interrupt_handler ISR_T1_Overflow:7
/*************************** ÕıÏÒ±í *****************************
       Ñù±¾±í: Ò»¸öÖÜÆÚ·Ö³É128¸öµã£¬Ã¿µã°´7Î»½øĞĞÁ¿»¯
****************************************************************/
flash unsigned char auc_SinParam [128] = {
64,67,
70,73,
76,79,
82,85,
88,91,
94,96,
99,102,
104,106,
109,111,
113,115,
117,118,
120,121,
123,124,
125,126,
126,127,
127,127,
127,127,
127,127,
126,126,
125,124,
123,121,
120,118,
117,115,
113,111,
109,106,
104,102,
99,96,
94,91,
88,85,
82,79,
76,73,
70,67,
64,60,
57,54,
51,48,
45,42,
39,36,
33,31,
28,25,
23,21,
18,16,
14,12,
10,9,
7,6,
4,3,
2,1,
1,0,
0,0,
0,0,
0,0,
1,1,
2,3,
4,6,
7,9,
10,12,
14,16,
18,21,
23,25,
28,31,
33,36,
39,42,
45,48,
51,54,
57,60};

//***************************  x_SW  *************************
//   x_SW ±í(8±¶): x_SW = ROUND(8*N_samples*f*510/Fck)
//************************************************************

//¸ßÆµ(ÁĞ)
//1209hz  ---> x_SW = 79
//1336hz  ---> x_SW = 87
//1477hz  ---> x_SW = 96
//1633hz  ---> x_SW = 107

const unsigned char auc_frequencyH [4] = {
107,96,
87,79};

//µÍÆµ(ĞĞ)
//697hz  ---> x_SW = 46
//770hz  ---> x_SW = 50
//852hz  ---> x_SW = 56
//941hz  ---> x_SW = 61

const unsigned char auc_frequencyL [4] = {
61,56,
50,46};


//**************************  È«¾Ö±äÁ¿ ****************************
unsigned char x_SWa = 0x00;               // ¸ßÆµĞÅºÅÂö³å¿í¶È
unsigned char x_SWb = 0x00;               // µÍÆµĞÅºÅÂö³å¿í¶È
unsigned int  X_LUTaExt = 0;           	  
unsigned int  X_LUTbExt = 0;              
unsigned int  X_LUTa;                   
unsigned int  X_LUTb;                     

/*****************************************************************
                    ¶¨Ê±Æ÷Òç³öÖĞ¶Ï·şÎñ³ÌĞò
******************************************************************/
void ISR_T1_Overflow (void)
{ 
  X_LUTaExt += x_SWa;       
  X_LUTbExt += x_SWb;
            // Êı¾İ¹æ¸ñ»¯
  X_LUTa  =  (char)(((X_LUTaExt+4) >> 3)&(0x007F)); 
  X_LUTb  =  (char)(((X_LUTbExt+4) >> 3)&(0x007F));
           // ¼ÆËã PWM Öµ: ¸ßÆµÖµ + 3/4 µÍÆµÖµ
  OCR1A = (auc_SinParam[X_LUTa] + (auc_SinParam[X_LUTb]-(auc_SinParam[X_LUTb]>>2)));
}

/***********************************************************
                        ³õÊ¼»¯
***********************************************************/
void init (void)
{
  MCUCR=0x00;
  TIMSK  = 0x80;                     // T1 Òç³öÖĞ¶ÏÊ¹ÄÜ
  TCCR1A = (1<<COM1A1)+(1<<PWM10);   // ²»·­×ª¡¢8Î»PWM
  TCCR1B = (1<<CS10);                // Ô¤·ÖÆµÏµÊıÎª1¡¢¼´CLK/1
  DDRD   = (1 <<PD5);               // PD5 (OC1A)ÓÃ×÷Êä³ö
  _SEI();                     	     // È«¾ÖÖĞ¶ÏÊ¹ÄÜ
}

/*********************************************************************
      Îª´ÓPORT C¿Ú¶ÁÈ¡ÎÈ¶¨µÄ°´¼üÊı¾İ£¬Ëù±ØĞëµÄÑÓÊ±³ÌĞò£¨Ïû¶¶ÑÓÊ±£©
*********************************************************************/
void Delay (void)
{
  int i;
  for (i = 0; i < delaycyc; i++) _NOP();
}

/********************************************************************
                            Ö÷³ÌĞò
      ´ÓPORT C¿Ú¶ÁÈ¡°´¼üÊı¾İ(Èç£ºSL¡ AVRÊµÑé°å) £¬À´È·¶¨²úÉúÄÄ¸ö
      ¸ßÆµ(ÁĞ)ºÍµÍÆµ(ĞĞ)ĞÅºÅµÄ»ìºÏĞÅºÅ£¬²¢ÇÒĞŞÕı x_SWa ºÍ x_SWb¡£
                   ĞĞ  -> PINC ¸ßËÄÎ»
                   ÁĞ  -> PINC µÍËÄÎ»
*********************************************************************/

void main (void)
{
  unsigned char uc_Input;
  unsigned char uc_Counter = 0;
  init();
  for(;;){ 
     // ¸ßËÄÎ» - ĞĞ
    DDRC  = 0x0F;           // ¸ßËÄÎ»ÊäÈë¡¢µÍËÄÎ»Êä³ö
    PORTC = 0xF0;           // ¸ßËÄÎ»´ò¿ªÉÏÎ»¡¢µÍËÄÎ»Êä³öµÍµçÆ½
    uc_Counter = 0;
    Delay();                          // ÑÓÊ±µÈ´ı Port C µçÆ½ÎÈ¶¨
    uc_Input = PINC;                  // ¶ÁÈ¡ Port C
    do 
    {
      if(!(uc_Input & 0x80))          // ¼ì²éMSBÊÇ·ñÎªµÍ
      {
                                      // È¡µÍÒôÂö³å¿í¶È²¢½áÊøÑ­»·
        x_SWb = auc_frequencyL[uc_Counter];  
        uc_Counter = 4;
      }
      else
      {
        x_SWb = 0;                    // Ã»ÓĞÆµÂÊµ÷ÖÆÒªÇó
      }
      uc_Counter++;
      uc_Input = uc_Input << 1;       // ×óÒÆÒ»Î»
    } while ((uc_Counter < 4));
 
    // µÍËÄÎ» - ÁĞ
    DDRC  = 0xF0;          // ¸ßËÄÎ»Êä³ö¡¢µÍËÄÎ»ÊäÈë
    PORTC = 0x0F;          // ¸ßËÄÎ»Êä³öµÍµçÆ½¡¢µÍËÄÎ»´ò¿ªÉÏÀ­
    uc_Counter = 0;
    Delay();               // ÑÓÊ±µÈ´ı Port C µçÆ½ÎÈ¶¨
    uc_Input = PINC;
    uc_Input = uc_Input << 4;     
    do 
    {
      if(!(uc_Input & 0x80))    // ¼ì²é MSB ÊÇ·ñÎªµÍ
      {
                                
        x_SWa = auc_frequencyH[uc_Counter];//È¡¸ßÒôÂö³å¿í¶È²¢½áÊøÑ­»·
        uc_Counter = 4;
      }
      else 
      {
        x_SWa = 0;                 
      }
      uc_Counter++;
      uc_Input = uc_Input << 1;
    } while (uc_Counter < 4);
  } 
}

